
"""

@Author: Samarth BM

@Date: 2021-11-10

@Last Modified by: Samarth BM

@Title : To create a dataframe from titanic.csv and perform spark sql by creating temporary view.

"""

In [2]:
import findspark

In [3]:
findspark.init('/home/samarth/spark/')

In [4]:
from pyspark.sql import *
spark = SparkSession.builder.getOrCreate()
from pyspark.sql.functions import *

21/11/12 00:20:29 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4042. Attempting port 4043.
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4043. Attempting port 4044.
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4044. Attempting port 4045.
21/11/12 00:20:33 WARN Utils: Service 'SparkUI' could not bind on port 4045. Attempting port 4046.

In [5]:
df= spark.read.option("inferSchema", "true").csv("hdfs://localhost:9000/FileForRDD/titanic_train.csv", header=True)

In [6]:
#df.createOrReplaceTempView("titanic")

In [7]:
df1=df.select("passenger_id","pclass", "name", "age","survived")

In [8]:
df1.createOrReplaceTempView("titanic")

In [9]:
df1.show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|        1216|     3|  Smyth, Miss. Julia|null|       1|
|         699|     3|     Cacic, Mr. Luka|38.0|       0|
|        1267|     3|Van Impe, Mrs. Je...|30.0|       0|
|         449|     2|Hocking, Mrs. Eli...|54.0|       1|
|         576|     2|     Veal, Mr. James|40.0|       0|
|        1083|     3|Olsen, Mr. Henry ...|28.0|       0|
|         898|     3|Johnson, Mr. Will...|19.0|       0|
|         560|     2|Sinkkonen, Miss. ...|30.0|       1|
|        1079|     3|  Ohman, Miss. Velin|22.0|       1|
|         908|     3|Jussila, Miss. Ma...|21.0|       0|
|         313|     1|Widener, Mr. Harr...|27.0|       0|
|          43|     1|Bucknell, Mrs. Wi...|60.0|       1|
|         233|     1|Potter, Mrs. Thom...|56.0|       1|
|         446|     2|"Hocking, Miss. E...|20.0|       1|
|         602|     3|Abbott, Mr. Rossm...|16.0|       0|
|         884|     3|Jensen, Mr. Niels...|48.0|       0|
|         497|     2|Maybery, Mr. Fran...|40.0|       0|
|        1003|     3|  McCoy, Mr. Bernard|null|       1|
|          36|     1|Bowerman, Miss. E...|22.0|       1|
|        1088|     3|Olsson, Mr. Oscar...|32.0|       1|
+------------+------+--------------------+----+--------+
only showing top 20 rows

In [10]:
data=spark.sql("SELECT*FROM titanic")

In [11]:
data.show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|        1216|     3|  Smyth, Miss. Julia|null|       1|
|         699|     3|     Cacic, Mr. Luka|38.0|       0|
|        1267|     3|Van Impe, Mrs. Je...|30.0|       0|
|         449|     2|Hocking, Mrs. Eli...|54.0|       1|
|         576|     2|     Veal, Mr. James|40.0|       0|
|        1083|     3|Olsen, Mr. Henry ...|28.0|       0|
|         898|     3|Johnson, Mr. Will...|19.0|       0|
|         560|     2|Sinkkonen, Miss. ...|30.0|       1|
|        1079|     3|  Ohman, Miss. Velin|22.0|       1|
|         908|     3|Jussila, Miss. Ma...|21.0|       0|
|         313|     1|Widener, Mr. Harr...|27.0|       0|
|          43|     1|Bucknell, Mrs. Wi...|60.0|       1|
|         233|     1|Potter, Mrs. Thom...|56.0|       1|
|         446|     2|"Hocking, Miss. E...|20.0|       1|
|         602|     3|Abbott, Mr. Rossm...|16.0|       0|
|         884|     3|Jensen, Mr. Niels...|48.0|       0|
|         497|     2|Maybery, Mr. Fran...|40.0|       0|
|        1003|     3|  McCoy, Mr. Bernard|null|       1|
|          36|     1|Bowerman, Miss. E...|22.0|       1|
|        1088|     3|Olsson, Mr. Oscar...|32.0|       1|
+------------+------+--------------------+----+--------+
only showing top 20 rows

In [12]:
spark.sql("SELECT pclass,name FROM titanic").show()

+------+--------------------+
|pclass|                name|
+------+--------------------+
|     3|  Smyth, Miss. Julia|
|     3|     Cacic, Mr. Luka|
|     3|Van Impe, Mrs. Je...|
|     2|Hocking, Mrs. Eli...|
|     2|     Veal, Mr. James|
|     3|Olsen, Mr. Henry ...|
|     3|Johnson, Mr. Will...|
|     2|Sinkkonen, Miss. ...|
|     3|  Ohman, Miss. Velin|
|     3|Jussila, Miss. Ma...|
|     1|Widener, Mr. Harr...|
|     1|Bucknell, Mrs. Wi...|
|     1|Potter, Mrs. Thom...|
|     2|"Hocking, Miss. E...|
|     3|Abbott, Mr. Rossm...|
|     3|Jensen, Mr. Niels...|
|     2|Maybery, Mr. Fran...|
|     3|  McCoy, Mr. Bernard|
|     1|Bowerman, Miss. E...|
|     3|Olsson, Mr. Oscar...|
+------+--------------------+
only showing top 20 rows

In [13]:
spark.sql("SELECT * FROM titanic WHERE `survived`=1").show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|        1216|     3|  Smyth, Miss. Julia|null|       1|
|         449|     2|Hocking, Mrs. Eli...|54.0|       1|
|         560|     2|Sinkkonen, Miss. ...|30.0|       1|
|        1079|     3|  Ohman, Miss. Velin|22.0|       1|
|          43|     1|Bucknell, Mrs. Wi...|60.0|       1|
|         233|     1|Potter, Mrs. Thom...|56.0|       1|
|         446|     2|"Hocking, Miss. E...|20.0|       1|
|        1003|     3|  McCoy, Mr. Bernard|null|       1|
|          36|     1|Bowerman, Miss. E...|22.0|       1|
|        1088|     3|Olsson, Mr. Oscar...|32.0|       1|
|         978|     3|   Lulic, Mr. Nikola|27.0|       1|
|         438|     2|  Herman, Miss. Kate|24.0|       1|
|         661|     3|Badman, Miss. Emi...|18.0|       1|
|        1002|     3| McCoy, Miss. Alicia|null|       1|
|        1162|     3|    Ryan, Mr. Edward|null|       1|
|         249|     1|Ryerson, Master. ...|13.0|       1|
|         407|     2|Faunthorpe, Mrs. ...|29.0|       1|
|         275|     1|Spedden, Mrs. Fre...|40.0|       1|
|          87|     1|Daniel, Mr. Rober...|27.0|       1|
|         540|     2|Quick, Miss. Phyl...| 2.0|       1|
+------------+------+--------------------+----+--------+
only showing top 20 rows

In [14]:
spark.sql("SELECT * FROM titanic WHERE `age`>=0 ORDER BY age desc limit 10").show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|          14|     1|Barkworth, Mr. Al...|80.0|       1|
|          61|     1|Cavendish, Mrs. T...|76.0|       1|
|        1235|     3| Svensson, Mr. Johan|74.0|       0|
|         506|     2|Mitchell, Mr. Hen...|70.0|       0|
|          81|     1|Crosby, Capt. Edw...|70.0|       0|
|         285|     1|  Straus, Mr. Isidor|67.0|       0|
|         782|     3|    Duane, Mr. Frank|65.0|       0|
|         221|     1|Ostby, Mr. Engelh...|65.0|       0|
|         115|     1|   Fortune, Mr. Mark|64.0|       0|
|          83|     1|Crosby, Mrs. Edwa...|64.0|       1|
+------------+------+--------------------+----+--------+

In [15]:
spark.sql("SELECT COUNT(passenger_id) FROM titanic").show()

+-------------------+
|count(passenger_id)|
+-------------------+
|                850|
+-------------------+

In [16]:
spark.sql("SELECT MAX(age) FROM titanic").show()

+--------+
|max(age)|
+--------+
|    80.0|
+--------+

In [17]:
spark.sql("SELECT MIN(age) FROM titanic").show()

+--------+
|min(age)|
+--------+
|  0.1667|
+--------+

In [18]:
spark.sql("SELECT * FROM titanic WHERE `age`>60 ORDER BY age").show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|        1225|     3|  Storey, Mr. Thomas|60.5|       0|
|         300|     1|Van der hoef, Mr....|61.0|       0|
|        1068|     3|Nysveen, Mr. Joha...|61.0|       0|
|         487|     2|   Lingane, Mr. John|61.0|       0|
|         511|     2|Myles, Mr. Thomas...|62.0|       0|
|         279|     1|Stead, Mr. Willia...|62.0|       0|
|         321|     1|  Wright, Mr. George|62.0|       0|
|         455|     2|Howard, Mr. Benjamin|63.0|       0|
|         286|     1|Straus, Mrs. Isid...|63.0|       0|
|         217|     1|Nicholson, Mr. Ar...|64.0|       0|
|         115|     1|   Fortune, Mr. Mark|64.0|       0|
|          83|     1|Crosby, Mrs. Edwa...|64.0|       1|
|         782|     3|    Duane, Mr. Frank|65.0|       0|
|         221|     1|Ostby, Mr. Engelh...|65.0|       0|
|         285|     1|  Straus, Mr. Isidor|67.0|       0|
|         506|     2|Mitchell, Mr. Hen...|70.0|       0|
|          81|     1|Crosby, Capt. Edw...|70.0|       0|
|        1235|     3| Svensson, Mr. Johan|74.0|       0|
|          61|     1|Cavendish, Mrs. T...|76.0|       1|
|          14|     1|Barkworth, Mr. Al...|80.0|       1|
+------------+------+--------------------+----+--------+

In [19]:
spark.sql("SELECT passenger_id FROM titanic WHERE age = (SELECT MAX(age) FROM titanic)").show()

+------------+
|passenger_id|
+------------+
|          14|
+------------+

In [20]:
spark.sql("SELECT * FROM titanic WHERE passenger_id=14").show()

+------------+------+--------------------+----+--------+
|passenger_id|pclass|                name| age|survived|
+------------+------+--------------------+----+--------+
|          14|     1|Barkworth, Mr. Al...|80.0|       1|
+------------+------+--------------------+----+--------+

In [21]:
spark.sql("SELECT MAX(age) AS `Maximum age` FROM titanic").show()

+-----------+
|Maximum age|
+-----------+
|       80.0|
+-----------+